tap "codeclimate/formulae"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "unused-code/formulae"
brew "openssl@1.1"
brew "asciidoctor"
brew "gdbm"
brew "libffi"
brew "readline"
brew "sqlite"
brew "atk"
brew "autoconf"
brew "automake"
brew "bash"
brew "bash-completion@2", link: false
brew "bat"
brew "bison"
brew "coreutils"
brew "cowsay"
brew "libssh2"
brew "dark-mode"
brew "docker", link: false
brew "emacs"
brew "exercism"
brew "gobject-introspection"
brew "sdl2"
brew "ffmpeg"
brew "findutils"
brew "freetds"
brew "fzf"
brew "gd"
brew "gdk-pixbuf"
brew "geckodriver"
brew "ghi"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnupg", link: false
brew "go"
brew "gotags"
brew "pango"
brew "graphviz"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "libyaml"
brew "mas"
brew "mercurial"
brew "moreutils"
brew "mysql", restart_service: true
brew "neovim"
brew "openshift-cli"
brew "pandoc"
brew "php"
brew "postgresql"
brew "postgis"
brew "postgresql@10"
brew "postgresql@11"
brew "psqlodbc"
brew "ranger"
brew "reattach-to-user-namespace"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby"
brew "rust"
brew "sdl"
brew "starship"
brew "swagger-codegen"
brew "the_silver_searcher"
brew "themekit"
brew "tmux"
brew "tree"
brew "vim"
brew "watchman"
brew "webkit2png"
brew "wget"
brew "wxmac"
brew "youtube-dl"
brew "zsh"
brew "codeclimate/formulae/codeclimate"
brew "heroku/brew/heroku"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "unused-code/formulae/unused"
cask "1password"
cask "adium"
cask "adobe-acrobat-reader"
cask "alacritty"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "anki"
cask "atext"
cask "atom"
cask "balsamiq-mockups"
cask "blender"
cask "boostnote"
cask "brave-browser"
cask "caffeine"
cask "calibre"
cask "chromedriver"
cask "clean-me"
cask "cleanmymac"
cask "cura-lulzbot"
cask "daisydisk"
cask "dash"
cask "day-o"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "dbvisualizer"
cask "digikam"
cask "discord"
cask "divvy"
cask "dropbox"
cask "etcher"
cask "evernote"
cask "firefox"
cask "fluid"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-for-powerline"
cask "font-fira-sans"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-firamono-nerd-font-mono"
cask "font-hack-nerd-font"
cask "font-hack-nerd-font-mono"
cask "font-inconsolata"
cask "font-inconsolata-dz"
cask "font-inconsolata-dz-for-powerline"
cask "font-inconsolata-for-powerline"
cask "font-inconsolata-nerd-font"
cask "font-inconsolata-nerd-font-mono"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-nerd-font-mono"
cask "font-monoid"
cask "font-monoid-nerd-font"
cask "font-monoid-nerd-font-mono"
cask "freeplane"
cask "gephi"
cask "gifox"
cask "gimp"
cask "github"
cask "google-chrome"
cask "gpg-suite"
cask "graphiql"
cask "graphql-playground"
cask "inkscape"
cask "insomnia"
cask "intellij-idea-ce"
cask "iterm2"
cask "java8"
cask "joplin"
cask "kaleidoscope"
cask "keybase"
cask "kindle"
cask "kitty"
cask "krita"
cask "lastpass"
cask "libreoffice"
cask "limechat"
cask "mactex"
cask "meld"
cask "minecraft"
cask "monodraw"
cask "mysqlworkbench"
cask "ngrok"
cask "nvalt"
cask "pastor"
cask "phantomjs"
cask "postgres"
cask "postico"
cask "postman"
cask "qfinder-pro"
cask "racket"
cask "react-native-debugger"
cask "remember-the-milk"
cask "renamer"
cask "scrivener"
cask "scummvm"
cask "sdformatter"
cask "sequel-pro"
cask "skim"
cask "slack"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "steam"
cask "textual"
cask "the-unarchiver"
cask "tunnelblick"
cask "vagrant"
cask "viscosity"
cask "vlc"
cask "xquartz"
cask "yed"
cask "zettlr"
