tap "homebrew/cask"
tap "homebrew/cask-fonts"
# tap "codeclimate/formulae"
tap "gigalixir/brew"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"


# System
# TODO: Add this as a command to add to bashrc or zshrc if it's not there
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "openssl" # LEAVE THIS AT THE TOP!
brew "coreutils"
brew "findutils"
brew "moreutils"

brew "asciidoctor"
brew "bash" # Install bash 4
brew "bash-completion2"
# brew "codeclimate/formulae/codeclimate"
brew "curl"
brew "exercism"
brew "ffmpeg"
brew "fzf"
brew "ghi"
brew "gigalixir"
brew "git"
brew "git-lfs"
# brew "gnu-sed", args: ["with-default-names"]
brew "gnupg"
brew "graphviz"
brew "heroku"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "libssh2"
brew "libyaml" # should come after openssl
brew "neovim"
brew "openjdk"
brew "pandoc"
brew "poppler"
brew "readline"
brew "reattach-to-user-namespace" # Fixes tmux macOS issues
brew "ripgrep"
brew "starship"
brew "rcm"
brew "tmux"
brew "tree"
brew "universal-ctags", args: ["HEAD"]
brew "watchman"
brew "webkit2png"
brew "wget", args: ["with-iri"]
brew "wxmac" # Erlang
brew "youtube-dl"
brew "zsh"


# Datastores
brew "mysql", restart_service: :changed
brew "postgresql", restart_service: :changed
brew "redis", restart_service: :changed
brew "sqlite"

# Misc I had installed
# brew "gmp@4"
# brew "cloog", link: false
# brew "cscope"
# brew "mpfr@2"
# brew "libmpc@0.8"
# brew "gcc@4.9"
# brew "libffi"
# brew "gnupg"
# brew "isl@0.11"
# brew "jq"
# brew "libevent"
# brew "readline", link: true
# brew "pkg-config"
# brew "qt"
# brew "unixodbc"
# brew "xhyve", args: ["HEAD"]
