# System
# In order to use GNU utils instead of mac provided equivalents,
# add the following to zshrc or bashrc:
#       export PATH=$(brew --prefix coreutils)/libexec/gnubin:$PATH
brew "openssl" # LEAVE THIS AT THE TOP!
brew "coreutils"
brew "findutils"
brew "moreutils"

brew "asciidoctor"
brew "bash"
brew "bash-completion2"
brew "curl"
brew "exercism"
brew "ffmpeg"
brew "fzf"
# brew "ghi"
brew "git"
brew "git-lfs"
brew "gnu-sed", args: ["with-default-names"]
brew "gnupg"
brew "graphviz"
# brew "heroku"
brew "htop"
# brew "hugo"
# brew "imagemagick"
# brew "libssh2"
brew "libyaml" # should come after openssl
brew "neovim"
brew "reattach-to-user-namespace" # Fixes tmux macOS issues
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
# brew "universal-ctags", args: ["HEAD"]
brew "watchman"
# brew "webkit2png"
brew "wget", args: ["with-iri"]
# brew "wxmac" # Erlang
# brew "youtube-dl"
# brew "zsh"


# Datastores
# brew "mysql", restart_service: :changed
# brew "postgresql", restart_service: :changed
# brew "redis", restart_service: :changed
# brew "sqlite"

# Misc I had installed
# brew "gmp@4"
# brew "cloog", link: false
# brew "cscope"
# brew "mpfr@2"
# brew "libmpc@0.8"
# brew "gcc@4.9"
# brew "libffi"
# brew "gnupg"
# brew "isl@0.11"
# brew "jq"
# brew "libevent"
# brew "readline", link: true
# brew "pkg-config"
# brew "qt"
# brew "unixodbc"
# brew "xhyve", args: ["HEAD"]
